print("Салтиков А.В \nЛабораторна робота №1 \nВаріант 19 \nРозпізнання прямокутних трикутників.  \n")
import math

a = int(input("Введіть сторону a"))
b = int(input("Введіть сторону b"))
c = int(input("Введіть сторону c"))

if a ** 2 + b ** 2 == c ** 2:
    print("Трикутник прямокутний")

elif a ** 2 + c ** 2 == b ** 2:
    print("Трикутник прямокутний")


elif c ** 2 + b ** 2 == a ** 2:
    print("Трикутник прямокутний")

else:
    сosc = (a * a + b * b - c * c) / (2 * a * b)

print(math.acos(сosc) * 57.2958)
